app/Controllers/AppController.php

SELECT COUNT(*) AS `numrows`
FROM `supplier`
SELECT COUNT(*) AS `numrows`
FROM `barang`
SELECT COUNT(*) AS `numrows`
FROM `barang_masuk`
SELECT COUNT(*) AS `numrows`
FROM `barang_keluar`
---
    public function dashboard(){
        if((session()->admin_role) == "admin"){
            $rows1 = $this->supplierModel
                ->countAllResults();
            $rows2 = $this->barangModel
                ->countAllResults();
            $rows3 = $this->barangmasukModel
                ->countAllResults();
            $rows4 = $this->barangkeluarModel
                ->countAllResults();

SELECT *
FROM `supplier`
ORDER BY `supplierID` ASC
---
    public function data_supplier(){
        $rows = $this->supplierModel
                ->orderBy("supplierID","asc")
                ->findAll();

SELECT *
FROM `barang`
ORDER BY `productID` ASC
---
    public function data_barang(){
        $rows = $this->barangModel
                ->orderBy("productID","asc")
                ->findAll();

SELECT *
FROM `barang`
WHERE `productID` = 'ASW-G-08'
 LIMIT 1
SELECT *
FROM `supplier`
ORDER BY `supplierID` ASC
---
    public function edit_barang($productID){
        $barang = $this->barangModel
                    ->where("productID", $productID)
                    ->first();

        $rows = $this->supplierModel
                ->orderBy("supplierID","asc")
                ->findAll();

SELECT *
FROM `barang_masuk`
ORDER BY `transactionID` ASC
---
    public function data_barangmasuk(){
        $rows = $this->barangmasukModel
                ->orderBy("transactionID","asc")
                ->findAll();

SELECT *
FROM `barang_masuk`
WHERE `transactionID` = '123'
 LIMIT 1
SELECT *
FROM `barang`
ORDER BY `productID` ASC
---
    public function edit_barangmasuk($transactionID){
        $barang_masuk = $this->barangmasukModel
                    ->where("transactionID", $transactionID)
                    ->first();

        $rows = $this->barangModel
                ->orderBy("productID","asc")
                ->findAll();

SELECT *
FROM `barang_masuk`
WHERE `transactionID` = '123'
 LIMIT 1
SELECT *
FROM `barang`
WHERE `productID` = 'ASW-G-08'
 LIMIT 1
UPDATE `barang_masuk` SET `transactionID` = '123', `tanggal` = '2023-07-10', `productID` = 'ASW-G-08', `jumlah_masuk` = '2'
WHERE `transactionID` = '123'
UPDATE `barang` SET `stok` = 7
WHERE `productID` = 'ASW-G-08'
---
    public function proses_edit_barangmasuk(){
        // Ambil Data dari Form
        $transactionID   = $this->request->getPost("transactionID");
        $tanggal         = $this->request->getPost("tanggal");
        $productID       = $this->request->getPost("productID");
        $jumlah_masuk    = $this->request->getPost("jumlah_masuk");

        $barang_masuk = $this->barangmasukModel
                    ->where("transactionID", $transactionID)
                    ->first();

        $barang = $this->barangModel
        ->where("productID", $productID)
        ->first();

        $barang2 = $this->barangModel
        ->where("productID", $barang_masuk->productID)
        ->first();

        if($barang->stok - $barang_masuk->jumlah_masuk + $jumlah_masuk < 0){
            $this->session->setFlashdata('pesan', 'Stok barang tidak mencukupi');
            return redirect()->to(base_url("data_barangmasuk"));
        }elseif($barang_masuk->productID == $productID){
            $this->barangmasukModel
                ->where("transactionID", $transactionID)
                ->set([
                    "transactionID" => $transactionID,
                    "tanggal" => $tanggal,
                    "productID" => $productID,
                    "jumlah_masuk" => $jumlah_masuk,
                ])->update();

            $this->barangModel
                ->where("productID", $productID)
                ->set([
                    "stok" => $barang->stok - $barang_masuk->jumlah_masuk + $jumlah_masuk,
                ])->update();

SELECT *
FROM `barang_keluar`
ORDER BY `transactionID` ASC
---
    public function data_barangkeluar(){
        $rows = $this->barangkeluarModel
                ->orderBy("transactionID","asc")
                ->findAll();