app/Controllers/LoginController.php

SELECT *
FROM `user`
WHERE `username` = 'admin1'
 LIMIT 1
---
    public function proses_login(){
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $admin = $this->userModel->where("username", $username)->first();